docs/math530/KBrefGramSchmidtProcedure.tex
% Created 2021-09-11 Sat 08:18
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Gram-Schmidt Procedure}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Gram-Schmidt Procedure},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Axler6.31 Gram-Schmidt Procedure}
\label{sec:org3c0ee38}
The Gram-Schmidt Procedure is used to turn a list into an orthonormal list with the same span. It's useful for finding \href{KBrefOrthonormalBasis.org}{orthonormal bases}.
\begin{quote}
Suppose \(v_1, \ldots, v_m\) is a linearly independent list of vectors in \(V\). Let \(e_1 = v_1 / \lVert v_1 \rVert\). For \(j = 2, \ldots, m\), define \(e_j\) inductively by
\[\begin{aligned}
  e_j = \frac{v_j - \langle  v_j, e_1 \rangle e_1 - \cdots - \langle v_j, e_{j-1} \rangle e_{j-1}}{ \lVert \text{<numerator>} \rVert  }
  \end{aligned}\]

Then \(e_1, \ldots, e_m\) is an orthonormal list of vectors in \(V\) s.t. each prefix span is the same as in \(v_1, \ldots, v_m\).
\end{quote}
\subsection{intuition}
\label{sec:orgd6abc15}
Basically, for each vector, we divide out the components from the previous vectors and then normalize the size to ensure the norm is one.

It's kind of like the orthogonal decomposition.
\section{results}
\label{sec:orge700b4d}
\subsection{Axler6.34 orthonormal basis exists in finite dim vec spaces}
\label{sec:org582747f}
since every finite dim vec space has a basis that can be Gram-schmidt-ed
\subsection{Axler6.35 orthonormal lists extend to orthonormal bases}
\label{sec:org5b75e85}
just extend the orthonormal list into a basis, and then gram-schmidt-ify the vectors you added
\subsection{Axler6.37 upper-triangular matrix wrt orthonormal basis}
\label{sec:org41a02b2}
If an upper triangular matrix exists for some operator, then an upper-triangular matrix exists for an orthonormal basis too.

Proof: prefix span invariance is a condition for an upper triangular matrix, so the prefix span equality implies that if it could be upper triangular before, then it still can be with the orthonormal basis.

An application of this is \href{KBrefSchursTheorem.org}{Schur's Theorem}
\end{document}
